Masmiseim36/nxpSDK/devices/MKE16Z4/MKE16Z4.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>MSCAN</name>
      <description>Modular/Scalable Controller Area Network (MSCAN)</description>
      <groupName>MSCAN</groupName>
      <prependToName>MSCAN_</prependToName>
      <baseAddress>0x40024000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x40</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>MSCAN_Rx</name>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>MSCAN_ORed</name>
        <value>31</value>
      </interrupt>
      <registers>
        <register>
          <name>CANCTL0</name>
          <description>MSCAN Control Register 0</description>
          <addressOffset>0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>INITRQ</name>
              <description>Initialization Mode Request</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INITRQ_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INITRQ_1</name>
                  <description>MSCAN in initialization mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLPRQ</name>
              <description>Sleep Mode Request</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLPRQ_0</name>
                  <description>Running - The MSCAN functions normally.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLPRQ_1</name>
                  <description>Sleep mode request - The MSCAN enters sleep mode when CAN bus idle.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPE</name>
              <description>WakeUp Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WUPE_0</name>
                  <description>Wakeup disabled - The MSCAN ignores traffic on CAN.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WUPE_1</name>
                  <description>Wakeup enabled - The MSCAN is able to restart.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIME</name>
              <description>Timer Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TIME_0</name>
                  <description>Disable internal MSCAN timer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIME_1</name>
                  <description>Enable internal MSCAN timer.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCH</name>
              <description>Synchronized Status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYNCH_0</name>
                  <description>MSCAN is not synchronized to the CAN bus.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCH_1</name>
                  <description>MSCAN is synchronized to the CAN bus.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSWAI</name>
              <description>CAN Stops in Wait Mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CSWAI_0</name>
                  <description>The module is not affected during wait mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSWAI_1</name>
                  <description>The module ceases to be clocked during wait mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXACT</name>
              <description>Receiver Active Status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXACT_0</name>
                  <description>MSCAN is transmitting or idle.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXACT_1</name>
                  <description>MSCAN is receiving a message, including when arbitration is lost.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXFRM</name>
              <description>Received Frame Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXFRM_0</name>
                  <description>No valid message was received since last clearing this flag.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXFRM_1</name>
                  <description>A valid message was received since last clearing of this flag.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CANCTL1</name>
          <description>MSCAN Control Register 1</description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x11</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>INITAK</name>
              <description>Initialization Mode Acknowledge</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INITAK_0</name>
                  <description>Running - The MSCAN operates normally.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INITAK_1</name>
                  <description>Initialization mode active - The MSCAN has entered initialization mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLPAK</name>
              <description>Sleep Mode Acknowledge</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLPAK_0</name>
                  <description>Running - The MSCAN operates normally.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLPAK_1</name>
                  <description>Sleep mode active - The MSCAN has entered sleep mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUPM</name>
              <description>WakeUp Mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WUPM_0</name>
                  <description>MSCAN wakes on any dominant level on the CAN bus.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WUPM_1</name>
                  <description>MSCAN wakes only in case of a dominant pulse on the CAN bus that has a length of Twup.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BORM</name>
              <description>Bus-Off Recovery Mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BORM_0</name>
                  <description>Automatic bus-off recovery (see Bosch CAN 2.0A/B protocol specification).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BORM_1</name>
                  <description>Bus-off recovery upon user request.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LISTEN</name>
              <description>Listen Only Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LISTEN_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LISTEN_1</name>
                  <description>Listen only mode activated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOOPB</name>
              <description>Loopback Self Test Mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOOPB_0</name>
                  <description>Loopback self test disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOPB_1</name>
                  <description>Loopback self test enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKSRC</name>
              <description>MSCAN Clock Source</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLKSRC_0</name>
                  <description>MSCAN clock source is the oscillator clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKSRC_1</name>
                  <description>MSCAN clock source is the bus clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CANE</name>
              <description>MSCAN Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CANE_0</name>
                  <description>MSCAN module is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CANE_1</name>
                  <description>MSCAN module is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CANBTR0</name>
          <description>MSCAN Bus Timing Register 0</description>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>BRP</name>
              <description>Baud Rate Prescaler</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BRP_0</name>
                  <description>1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BRP_1</name>
                  <description>2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BRP_2</name>
                  <description>......</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BRP_3</name>
                  <description>......</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BRP_62</name>
                  <description>63</description>
                  <value>0x3E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BRP_63</name>
                  <description>64</description>
                  <value>0x3F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SJW</name>
              <description>Synchronization Jump Width</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SJW_0</name>
                  <description>1 Tq clock cycle.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SJW_1</name>
                  <description>2 Tq clock cycles.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SJW_2</name>
                  <description>3 Tq clock cycle.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SJW_3</name>
                  <description>4 Tq clock cycles.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CANBTR1</name>
          <description>MSCAN Bus Timing Register 1</description>
          <addressOffset>0x3</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>TSEG1</name>
              <description>Time Segment 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TSEG1_0</name>
                  <description>1 Tq clock cycle (not valid)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSEG1_1</name>
                  <description>2 Tq clock cycles (not valid)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSEG1_2</name>
                  <description>3 Tq clock cycles (not valid)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSEG1_3</name>
                  <description>4 Tq clock cycles</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSEG1_14</name>
                  <description>15 Tq clock cycles</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSEG1_15</name>
                  <description>16 Tq clock cycles</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSEG2</name>
              <description>Time Segment 2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TSEG2_0</name>
                  <description>1 Tq clock cycle (not valid)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSEG2_1</name>
                  <description>2 Tq clock cycles</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSEG2_2</name>
                  <description>3 Tq clock cycles</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSEG2_3</name>
                  <description>4 Tq clock cycles</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSEG2_4</name>
                  <description>5 Tq clock cycles</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSEG2_5</name>
                  <description>6 Tq clock cycles</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSEG2_6</name>
                  <description>7 Tq clock cycles</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSEG2_7</name>
                  <description>8 Tq clock cycles</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAMP</name>
              <description>Sampling</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAMP_0</name>
                  <description>One sample per bit.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMP_1</name>
                  <description>Three samples per bit. In this case, PHASE_SEG1 must be at least 2 time quanta (Tq).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
