Masmiseim36/nxpSDK/devices/MKE16Z4/MKE16Z4.xml
        <register>
          <name>STAT</name>
          <description>LPUART Status Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC00000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MA2F</name>
              <description>Match 2 Flag</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MA2F_0</name>
                  <description>Received data is not equal to MA2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MA2F_1</name>
                  <description>Received data is equal to MA2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MA1F</name>
              <description>Match 1 Flag</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MA1F_0</name>
                  <description>Received data is not equal to MA1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MA1F_1</name>
                  <description>Received data is equal to MA1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PF</name>
              <description>Parity Error Flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PF_0</name>
                  <description>No parity error.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PF_1</name>
                  <description>Parity error.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FE</name>
              <description>Framing Error Flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FE_0</name>
                  <description>No framing error detected. This does not guarantee the framing is correct.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FE_1</name>
                  <description>Framing error.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NF</name>
              <description>Noise Flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NF_0</name>
                  <description>No noise detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NF_1</name>
                  <description>Noise detected in the received character in the DATA register.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OR</name>
              <description>Receiver Overrun Flag</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OR_0</name>
                  <description>No overrun.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OR_1</name>
                  <description>Receive overrun (new LPUART data lost).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDLE</name>
              <description>Idle Line Flag</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE_0</name>
                  <description>No idle line detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDLE_1</name>
                  <description>Idle line was detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RDRF</name>
              <description>Receive Data Register Full Flag</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RDRF_0</name>
                  <description>Receive data buffer empty.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDRF_1</name>
                  <description>Receive data buffer full.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TC</name>
              <description>Transmission Complete Flag</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TC_0</name>
                  <description>Transmitter active (sending data, a preamble, or a break).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TC_1</name>
                  <description>Transmitter idle (transmission activity complete).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TDRE</name>
              <description>Transmit Data Register Empty Flag</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TDRE_0</name>
                  <description>Transmit data buffer full.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TDRE_1</name>
                  <description>Transmit data buffer empty.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAF</name>
              <description>Receiver Active Flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RAF_0</name>
                  <description>LPUART receiver idle waiting for a start bit.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAF_1</name>
                  <description>LPUART receiver active (RXD input not idle).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LBKDE</name>
              <description>LIN Break Detection Enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LBKDE_0</name>
                  <description>LIN break detect is disabled, normal break character can be detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LBKDE_1</name>
                  <description>LIN break detect is enabled. LIN break character is detected at length of 11 bit times (if M = 0) or 12 (if M = 1) or 13 (M10 = 1).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BRK13</name>
              <description>Break Character Generation Length</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BRK13_0</name>
                  <description>Break character is transmitted with length of 9 to 13 bit times.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BRK13_1</name>
                  <description>Break character is transmitted with length of 12 to 15 bit times.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RWUID</name>
              <description>Receive Wake Up Idle Detect</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RWUID_0</name>
                  <description>During receive standby state (RWU = 1), the IDLE bit does not get set upon detection of an idle character. During address match wakeup, the IDLE bit does not set when an address does not match.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RWUID_1</name>
                  <description>During receive standby state (RWU = 1), the IDLE bit gets set upon detection of an idle character. During address match wakeup, the IDLE bit does set when an address does not match.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXINV</name>
              <description>Receive Data Inversion</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXINV_0</name>
                  <description>Receive data not inverted.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXINV_1</name>
                  <description>Receive data inverted.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSBF</name>
              <description>MSB First</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MSBF_0</name>
                  <description>LSB (bit0) is the first bit that is transmitted following the start bit. Further, the first bit received after the start bit is identified as bit0.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSBF_1</name>
                  <description>MSB (bit9, bit8, bit7 or bit6) is the first bit that is transmitted following the start bit depending on the setting of CTRL[M], CTRL[PE] and BAUD[M10]. Further, the first bit received after the start bit is identified as bit9, bit8, bit7 or bit6 depending on the setting of CTRL[M] and CTRL[PE].</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXEDGIF</name>
              <description>RXD Pin Active Edge Interrupt Flag</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXEDGIF_0</name>
                  <description>No active edge on the receive pin has occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXEDGIF_1</name>
                  <description>An active edge on the receive pin has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LBKDIF</name>
              <description>LIN Break Detect Interrupt Flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LBKDIF_0</name>
                  <description>No LIN break character has been detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LBKDIF_1</name>
                  <description>LIN break character has been detected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
